Revit 2027 API
Wave.WaveDistribution Property
 The property labeled "Distribution" from the "Wave" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WaveDistribution { get; }
Public Shared ReadOnly Property WaveDistribution As String
	Get
public:
static property String^ WaveDistribution {
	String^ get ();
}
static member WaveDistribution : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WaveDistributionType".
See Also
Reference
Wave Class
Autodesk.Revit.DB.Visual Namespace